[
    {
        "content": "{name= 'John'; age= '18'; country= 'Turkey'; curvisa= 'No'; time_to_get_to_US= '1 year'; reason='university'}"
    },
    {
        "content": "Based on your background as an 18-year-old from Turkey planning to study at a university in the U.S. within the next year and currently not holding a visa, I recommend applying for an F-1 student visa.\n\nThe F-1 visa is specifically designed for individuals like you who wish to pursue academic studies in the United States at an accredited institution. To apply for an F-1 visa, you will first need to be accepted by a Student and Exchange Visitor Program (SEVP)-approved school. Once accepted, you can proceed with the visa application process, which may include an interview at the U.S. embassy or consulate in Turkey.\n\nMake sure to have all the necessary documentation ready, including your I-20 form issued by the school, proof of financial support, and intent to return to Turkey after completing your studies. Additionally, demonstrating ties to your home country, such as family, property, or job prospects, can strengthen your visa application.\n\nOverall, the F-1 student visa would be the most suitable option for you to pursue your university studies in the United States. Good luck with your academic journey!"
    },
    {
        "content": "[\n    {\n        \"title\": \"Research SEVP-Approved Schools\",\n        \"description\": \"Research and identify SEVP-approved schools in the U.S. that offer programs matching your academic interests and goals.\",\n        \"progress\": \"Not Started\",\n        \"timeline\": \"1 week\"\n    },\n    {\n        \"title\": \"Apply and Gain Acceptance to a SEVP-Approved School\",\n        \"description\": \"Complete the application process for your chosen SEVP-approved school and obtain an acceptance letter.\",\n        \"progress\": \"Not Started\",\n        \"timeline\": \"4-6 weeks\"\n    },\n    {\n        \"title\": \"Receive Form I-20 from School\",\n        \"description\": \"After being accepted, your school will issue you a Form I-20, which is a crucial document for the visa application.\",\n        \"progress\": \"Not Started\",\n        \"timeline\": \"1-2 weeks after acceptance\"\n    },\n    {\n        \"title\": \"Pay SEVIS Fee\",\n        \"description\": \"Pay the SEVIS I-901 fee to register in the Student and Exchange Visitor Information System (SEVIS).\",\n        \"progress\": \"Not Started\",\n        \"timeline\": \"Before scheduling visa interview\"\n    },\n    {\n        \"title\": \"Complete DS-160 Form\",\n        \"description\": \"Fill out the DS-160 form online with accurate and honest information.\",\n        \"progress\": \"Not Started\",\n        \"timeline\": \"At least 1 week before visa interview\"\n    },\n    {\n        \"title\": \"Schedule Visa Interview\",\n        \"description\": \"Schedule an appointment for a visa interview at the nearest U.S. embassy or consulate in Turkey.\",\n        \"progress\": \"Not Started\",\n        \"timeline\": \"After paying SEVIS fee\"\n    },\n    {\n        \"title\": \"Prepare Required Documents\",\n        \"description\": \"Gather all necessary documents such as passport, visa application fee receipt, Form I-20, DS-160 confirmation page, and financial documents.\",\n        \"progress\": \"Not Started\",\n        \"timeline\": \"At least 2 weeks before visa interview\"\n    },\n    {\n        \"title\": \"Attend Visa Interview\",\n        \"description\": \"Attend the scheduled visa interview at the U.S. embassy or consulate. Be prepared to discuss your academic plans and ties to Turkey.\",\n        \"progress\": \"Not Started\",\n        \"timeline\": \"As scheduled\"\n    }\n]"
    }
]